# -*- coding: utf-8 -*-
'''
Задание 4.7

Преобразовать MAC-адрес mac в двоичную строку такого вида:
'101010101010101010111011101110111100110011001100'

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

mac = 'AAAA:BBBB:CCCC'

print (bin(int(mac.split(':')[0], 16))[2:] + bin(int(mac.split(':')[1], 16))[2:] + bin(int(mac.split(':')[2], 16))[2:])
bin(int(mac.replace(':',''), 16))[2:]
print ('{:b}'.format(int(mac.replace(':' ''), 16)))

